import numpy as np
import pandas as pd
a3=pd.DataFrame([[5,6,3],[2,6,3],[3,8,0],[2,4,7]])  #数据框
print(a3)
#     0  1  2   行号
#  0  5  6  3
#  1  2  6  3
#  2  3  8  0
#  3  2  4  7
#列号
a4=pd.DataFrame([[5,6,3],[2,6,3],[3,8,0],[2,4,7]],columns=["a","b","c"])#指定列号
print("a4")
print(a4)

#通过字典创建数据框
b1=pd.DataFrame({
    "a":4,
    "b":[2,5,7],
    "three":list(str(982))

})
print(b1)
#第一列不够,自动填充,  字典,key:value
#    a  b three
# 0  4  2     9
# 1  4  5     8
# 2  4  7     2

a4.head()#头部数据,默认前五行
a4.tail()#尾部数据,默认后五行
a4.head(2)#前两行
print(a4.head(2))
a4.describe()#统计
a5=pd.DataFrame([[5,6,3],[2,6,3],[3,8,0],[2,4,7]],columns=["a","b","c"])#指定列号
print(a5.describe())
#               a         b         c
# count  4.000000  4.000000  4.000000    这一列4个元素
# mean   3.000000  6.000000  3.250000    这一列平均数
# std    1.414214  1.632993  2.872281    这一列标准差
# min    2.000000  4.000000  0.000000    这一列最小值
# 25%    2.000000  5.500000  2.250000    分位数
# 50%    2.500000  6.000000  3.000000
# 75%    3.500000  6.500000  4.000000
# max    5.000000  8.000000  7.000000

